Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32L152C-DISCO.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                   |I2C1|I2C2|SPI1 |SPI2 |USART1|USART2|USART3|TIM (PWM)           |USB|RCC       |SYS           
PA0 , // |B1 [Blue PushButton]          |    |    |     |     |      |      |      |*TIM2_CH1           |   |          |              
PA1 , // |SEG0 [GH08172T_SEG0]          |    |    |     |     |      |      |      |*TIM2_CH2           |   |          |              
PA2 , // |SEG1 [GH08172T_SEG1]          |    |    |     |     |      |*TX   |      |*TIM9_CH1 *TIM2_CH3 |   |          |              
PA3 , // |SEG2 [GH08172T_SEG2]          |    |    |     |     |      |*RX   |      |*TIM9_CH2 *TIM2_CH4 |   |          |              
PA4 , // |IDD_Measurement               |    |    |     |     |      |      |      |                    |   |          |              
PA5 , // |                              |    |    |*SCK |     |      |      |      |+TIM2_CH1           |   |          |              
PA6 , // |GRP2_Sampling [Touch_Slider_1]|    |    |*MISO|     |      |      |      |*TIM3_CH1 *TIM10_CH1|   |          |              
PA7 , // |GRP2_Ground [Touch_Slider_1]  |    |    |*MOSI|     |      |      |      |*TIM3_CH2 *TIM11_CH1|   |          |              
PA8 , // |COM0 [GH08172T_COM0]          |    |    |     |     |      |      |      |                    |   |          |              
PA9 , // |COM1 [GH08172T_COM1]          |    |    |     |     |*TX   |      |      |                    |   |          |              
PA10, // |COM2 [GH08172T_COM2]          |    |    |     |     |*RX   |      |      |                    |   |          |              
PA11, // |                              |    |    |+MISO|     |      |      |      |                    |*DM|          |              
PA12, // |                              |    |    |+MOSI|     |      |      |      |                    |*DP|          |              
PA13, // |SWDIO                         |    |    |     |     |      |      |      |                    |   |          |*JTMS-SWDIO   
PA14, // |SWCLK                         |    |    |     |     |      |      |      |                    |   |          |*JTCK-SWCLK   
PA15, // |SEG12 [GH08172T_SEG12]        |    |    |     |     |      |      |      |+TIM2_CH1           |   |          |*JTDI         
PB0 , // |GRP3_Sampling [Touch_Slider_3]|    |    |     |     |      |      |      |*TIM3_CH3           |   |          |              
PB1 , // |GRP3_Ground [Touch_Slider_3]  |    |    |     |     |      |      |      |*TIM3_CH4           |   |          |              
PB2 , // |                              |    |    |     |     |      |      |      |                    |   |          |              
PB3 , // |SEG3 [GH08172T_SEG3]          |    |    |+SCK |     |      |      |      |+TIM2_CH2           |   |          |*JTDO-TRACESWO
PB4 , // |SEG4 [GH08172T_SEG4]          |    |    |+MISO|     |      |      |      |+TIM3_CH1           |   |          |*JTRST        
PB5 , // |SEG5 [GH08172T_SEG5]          |    |    |+MOSI|     |      |      |      |+TIM3_CH2           |   |          |              
PB6 , // |LD4 [Blue Led]                |*SCL|    |     |     |+TX   |      |      |*TIM4_CH1           |   |          |              
PB7 , // |LD3 [Green Led]               |*SDA|    |     |     |+RX   |      |      |*TIM4_CH2           |   |          |*PVD_IN       
PB8 , // |SEG13 [GH08172T_SEG13]        |+SCL|    |     |     |      |      |      |+TIM10_CH1 *TIM4_CH3|   |          |              
PB9 , // |COM3 [GH08172T_COM3]          |+SDA|    |     |     |      |      |      |*TIM4_CH4 +TIM11_CH1|   |          |              
PB10, // |SEG6 [GH08172T_SEG6]          |    |*SCL|     |     |      |      |*TX   |+TIM2_CH3           |   |          |              
PB11, // |SEG7 [GH08172T_SEG7]          |    |*SDA|     |     |      |      |*RX   |+TIM2_CH4           |   |          |              
PB12, // |SEG8 [GH08172T_SEG8]          |    |    |     |     |      |      |      |+TIM10_CH1          |   |          |              
PB13, // |SEG9 [GH08172T_SEG9]          |    |    |     |*SCK |      |      |      |+TIM9_CH1           |   |          |              
PB14, // |SEG10 [GH08172T_SEG10]        |    |    |     |*MISO|      |      |      |+TIM9_CH2           |   |          |              
PB15, // |SEG11 [GH08172T_SEG11]        |    |    |     |*MOSI|      |      |      |+TIM11_CH1          |   |          |              
PC0 , // |SEG14 [GH08172T_SEG14]        |    |    |     |     |      |      |      |                    |   |          |              
PC1 , // |SEG15 [GH08172T_SEG15]        |    |    |     |     |      |      |      |                    |   |          |              
PC2 , // |SEG16 [GH08172T_SEG16]        |    |    |     |     |      |      |      |                    |   |          |              
PC3 , // |SEG17 [GH08172T_SEG17]        |    |    |     |     |      |      |      |                    |   |          |              
PC4 , // |GRP9_Sampling [Touch_Slider_2]|    |    |     |     |      |      |      |                    |   |          |              
PC5 , // |GRP9_Ground [Touch_Slider_2]  |    |    |     |     |      |      |      |                    |   |          |              
PC6 , // |SEG18 [GH08172T_SEG18]        |    |    |     |     |      |      |      |+TIM3_CH1           |   |          |              
PC7 , // |SEG19 [GH08172T_SEG19]        |    |    |     |     |      |      |      |+TIM3_CH2           |   |          |              
PC8 , // |SEG20 [GH08172T_SEG20]        |    |    |     |     |      |      |      |+TIM3_CH3           |   |          |              
PC9 , // |SEG21 [GH08172T_SEG21]        |    |    |     |     |      |      |      |+TIM3_CH4           |   |          |              
PC10, // |SEG22 [GH08172T_SEG22]        |    |    |     |     |      |      |+TX   |                    |   |          |              
PC11, // |SEG23 [GH08172T_SEG23]        |    |    |     |     |      |      |+RX   |                    |   |          |              
PC12, // |                              |    |    |     |     |      |      |      |                    |   |          |              
PC13, // |IDD_CNT_EN                    |    |    |     |     |      |      |      |                    |   |          |              
PC14, // |PC14-OSC32_IN                 |    |    |     |     |      |      |      |                    |   |*OSC32_IN |              
PC15, // |PC15-OSC32_OUT                |    |    |     |     |      |      |      |                    |   |*OSC32_OUT|              
PD2 , // |                              |    |    |     |     |      |      |      |                    |   |          |              
PH0 , // |                              |    |    |     |     |      |      |      |                    |   |*OSC_IN   |              
PH1 , // |                              |    |    |     |     |      |      |      |                    |   |*OSC_OUT  |              
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PH0 , GPIO_PIN_0 , GPIOH, GPIO_PIN_IO, false},
  { PH1 , GPIO_PIN_1 , GPIOH, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF5_SPI1,
    .mosi_port = GPIOA, 
    .mosi_pin =  GPIO_PIN_7, 
    .miso_alternate = GPIO_AF5_SPI1,
    .miso_port = GPIOA, 
    .miso_pin = GPIO_PIN_6, 
    .sck_alternate = GPIO_AF5_SPI1,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_5, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF5_SPI2,
    .mosi_port = GPIOB, 
    .mosi_pin =  GPIO_PIN_15, 
    .miso_alternate = GPIO_AF5_SPI2,
    .miso_port = GPIOB, 
    .miso_pin = GPIO_PIN_14, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_13, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C1,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_7,
    .scl_alternate = GPIO_AF4_I2C1,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_6,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF4_I2C2,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_11,
    .scl_alternate = GPIO_AF4_I2C2,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_10,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


uart_conf_t g_uart_config[] = {
  {
    //UART ID and IRQ
    .usart_typedef = USART1, .irqtype = USART1_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_9,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_10,
    .uart_af_remap = GPIO_AF7_USART1,
    .tx_alternate  = GPIO_AF7_USART1,
    .rx_alternate  = GPIO_AF7_USART1,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART2, .irqtype = USART2_IRQn,
    .tx_port = GPIOA, .tx_pin = GPIO_PIN_2,
    .rx_port = GPIOA, .rx_pin = GPIO_PIN_3,
    .uart_af_remap = GPIO_AF7_USART2,
    .tx_alternate  = GPIO_AF7_USART2,
    .rx_alternate  = GPIO_AF7_USART2,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
  {
    //UART ID and IRQ
    .usart_typedef = USART3, .irqtype = USART3_IRQn,
    .tx_port = GPIOB, .tx_pin = GPIO_PIN_10,
    .rx_port = GPIOB, .rx_pin = GPIO_PIN_11,
    .uart_af_remap = GPIO_AF7_USART3,
    .tx_alternate  = GPIO_AF7_USART3,
    .rx_alternate  = GPIO_AF7_USART3,
    .data_available = 0,
    .begin = 0,
    .end = 0,
    .uart_option = NATIVE_UART_E
  },
};

uint8_t NB_UART_MANAGED = sizeof(g_uart_config) / sizeof(g_uart_config[0]);

UART_HandleTypeDef g_UartHandle[sizeof(g_uart_config) / sizeof(g_uart_config[0])];


#define SAMPLINGTIME  ADC_SAMPLETIME_1CYCLE_5  /*!< ADC conversions sampling time. */

adc_config_str g_adc_config[] = {
};
